#### Name : Fawzi Abdelnaby Elnaggar
#### Chefaa - Data Scientest Task

## Task1:Python script to export this data in MySQL

In [101]:
!pip install mysqlclient

Requirement already satisfied: mysqlclient in c:\users\freecomp\anaconda3\lib\site-packages (2.1.0)

WARNING: You are using pip version 21.3.1; however, version 22.1 is available.
You should consider upgrading via the 'c:\users\freecomp\anaconda3\python.exe -m pip install --upgrade pip' command.

In [102]:
import pandas as pd
from sqlalchemy import create_engine
from openpyxl.utils.dataframe import dataframe_to_rows
from openpyxl import Workbook

In [103]:
# Read Data
MonthlyOrders = pd.read_excel('task2.xlsx', 'MonthlyOrders')
RegularOrders = pd.read_excel('task2.xlsx', 'RegularOrders')
StoresName = pd.read_excel('task2.xlsx', 'StoresName')
commission = pd.read_excel('task2.xlsx', 'commission')

# Drop Null Columns
commission = commission.drop(commission.columns[3], axis=1)
MonthlyOrders = MonthlyOrders.drop(['product title AR'], axis=1)
RegularOrders = RegularOrders.drop(['product title AR'], axis=1)

In [106]:
MonthlyOrders.columns = [i.strip() for i in MonthlyOrders.columns]
RegularOrders.columns = [i.strip() for i in RegularOrders.columns]
commission.columns = [i.strip() for i in commission.columns]

In [107]:
MonthlyOrders.head()

,Product title En,Product type,Delivery Date,price,quantity,Store Id,product categoury,city,user id,order id
0,bicycle.,sporting,2022-02-01 00:09:31,200.0,1,322,BabyToys,Cairo,300,500
1,train.,Gaming,2022-02-01 00:18:56,100.0,5,323,Entertainment,Giza,301,502
2,doll.,Gaming,2022-02-01 00:18:56,132.0,7,323,BabyToys,Giza,301,502
3,ball.,Gaming,2022-02-01 00:47:47,232.0,2,322,Entertainment,Cairo,302,503
4,teddy bear.,Baby Toys,2022-02-01 00:53:15,212.0,8,323,Games,Giza,301,504

In [108]:
RegularOrders.head()

,Product title En,Product type,Delivery Date,price,quantity,Store Id,product categoury,city,user id,order id
0,bicycle.,sporting,2022-02-01 00:09:31,200.0,6,322,BabyToys,Cairo,300,400
1,train.,Gaming,2022-02-01 00:18:56,100.0,5,323,Entertainment,Giza,301,401
2,doll.,Gaming,2022-02-01 00:18:56,33.0,4,323,BabyToys,Giza,301,401
3,ball.,Gaming,2022-02-01 00:47:47,232.0,4,322,Entertainment,Cairo,302,402
4,teddy bear.,Baby Toys,2022-02-01 00:53:15,212.0,8,323,Games,Giza,301,401

In [109]:
commission.head()

           StoreId  BabyToys  Entertainment  Games
0   322||CairoToys        10             15     20
1    323||GizaToys        20             15     10
2  311||FayoumToys        15             10     15

In [110]:
# Export to MySQL
engine = create_engine('mysql://root:admin@localhost:3306/chefaa_database') #change to connect your mysql

MonthlyOrders.to_sql(name='MonthlyOrders',con=engine,if_exists='replace',index=False) 
RegularOrders.to_sql(name='RegularOrders',con=engine,if_exists='replace',index=False) 
StoresName.to_sql(name='StoresName',con=engine,if_exists='replace',index=False) 
commission.to_sql(name='commission',con=engine,if_exists='replace',index=False)

C:\Users\FreeComp\anaconda3\lib\site-packages\pandas\io\sql.py:1444: UserWarning: The provided table name 'MonthlyOrders' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)
C:\Users\FreeComp\anaconda3\lib\site-packages\pandas\io\sql.py:1444: UserWarning: The provided table name 'RegularOrders' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)
C:\Users\FreeComp\anaconda3\lib\site-packages\pandas\io\sql.py:1444: UserWarning: The provided table name 'StoresName' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

## Task3: Creat separated sheets for every store including the data about its orders

In [114]:
wb = Workbook()
# Create Excel file
filename= 'data_Per_Store.xlsx'
# Optional section for formatting column widths of output file (applies to sheet 1)
add_column_widths = True
sheet1_dict = {'A':50, 'B':25, 'C':20, 'D':35, 'E':15, 'F':15, 'G':15, 'H':25, 'I':15,
               'J':15, 'K':15, 'L':25, 'M':15, 'N':15, 'O':15, 'P':25, 'Q':15, 'R':15}

lst = [MonthlyOrders,RegularOrders,commission]
for table_name in lst:
    if table_name.equals(commission) == True:
        store_column = 'StoreId'
    else:
        store_column = 'city'
    for store in table_name[store_column].unique():
        ws = wb.create_sheet(store)
        if table_name.equals(MonthlyOrders) == True:
            ws.title  = "MonthlyOrder_" + store
        elif table_name.equals(RegularOrders):
            ws.title  = "RegularOrder_" + store
        else:
            ws.title  = "Commission_" + store
        if add_column_widths:
             for col, dim in sheet1_dict.items():
                 wb[ws.title].column_dimensions[col].width = dim
        for r in dataframe_to_rows(table_name[table_name[store_column] == store], index=False, header=True):
            wb[ws.title].append(r)
        wb[ws.title].freeze_panes = 'A2'


wb.save(filename)
wb.close()